[
  {
    "image": "https://img.icons8.com/color/128/000000/whatsapp.png",
    "title": "WhatsApp Messenger",
    "companyName": "WhatsApp LLC",
    "id": 1,
    "description": "WhatsApp Messenger is the world's leading platform for fast, simple, and secure communication, connecting over a billion people across the globe with end-to-end encryption for all personal messages, calls, photos, and videos. Imagine a private, instantaneous channel to share your life’s daily moments—from quick texts with family to sending important documents to colleagues—all without the worry of data breaches or surveillance. Its intuitive interface makes group chats easy to manage, allowing friends, families, and even small businesses to coordinate, share media, and stay connected effortlessly. The app is a lightweight powerhouse, ensuring you never miss a beat with reliable notifications and a seamless transition from mobile to desktop. You can record and send voice messages with a single tap, share your live location to meet up with friends, and use the status feature to post temporary updates of your day, adding a layer of social storytelling to your private conversations. Whether you're in a busy city or a remote village, WhatsApp uses minimal data, making it the preferred choice for reliable, crystal-clear voice and video calls. It truly democratizes global communication, offering a personal and professional link that feels immediate, intimate, and absolutely dependable, allowing you to focus on the conversation, not the connection. Download it now to join the private communication revolution and experience messaging as it was meant to be: fast, free, and yours.",
    "size": 120,
    "reviews": "135M",
    "ratingAvg": 4.3,
    "downloads": "5M",
    "ratings": [
      { "name": "1 star", "count": 2500000 },
      { "name": "2 star", "count": 1500000 },
      { "name": "3 star", "count": 4000000 },
      { "name": "4 star", "count": 12000000 },
      { "name": "5 star", "count": 115000000 }
    ]
  },
  {
    "image": "https://img.icons8.com/color/128/000000/facebook-new.png",
    "title": "Facebook",
    "companyName": "Meta Platforms, Inc.",
    "id": 2,
    "description": "Facebook is the essential social hub for connecting with friends, family, and global communities, offering a dynamic platform to share your life's moments and stay informed on the world around you. Dive into your personalized news feed, a curated stream of updates, photos, videos, and articles tailored to your interests, ensuring you're always in the loop with what matters most to you. From posting a quick status update about your day to celebrating major milestones with high-resolution photo albums, Facebook provides the tools to document and share your journey authentically. You can join countless groups centered around hobbies, professional interests, or local communities, transforming the social network into a powerful tool for niche and hyper-local connection. Explore the Marketplace to buy and sell items within your community, tune into live video streams from public figures or friends, and use the Events feature to discover local gatherings and plan your social calendar. With robust messaging built in—and often powered by Messenger—you can keep private conversations going alongside your public posts, making it a comprehensive communication suite. Facebook is more than just a place to reconnect with old schoolmates; it’s a living, breathing digital city where you can build networks, advocate for causes, and experience culture and news as it breaks, all while tailoring your privacy settings to ensure your experience is comfortable and secure. Re-engage with the past through 'On This Day' memories and craft your future by connecting with professional contacts—Facebook is your comprehensive digital identity and social lifeline.",
    "size": 250,
    "reviews": "121M",
    "ratingAvg": 4.1,
    "downloads": "3M",
    "ratings": [
      { "name": "1 star", "count": 4800000 },
      { "name": "2 star", "count": 2600000 },
      { "name": "3 star", "count": 8000000 },
      { "name": "4 star", "count": 25000000 },
      { "name": "5 star", "count": 81000000 }
    ]
  },
  {
    "image": "https://img.icons8.com/color/128/000000/instagram-new.png",
    "title": "Instagram",
    "companyName": "Meta Platforms, Inc.",
    "id": 3,
    "description": "Instagram is the premier visual storytelling platform, inviting you to share your life through captivating photos and videos with the people who matter most, transforming your everyday moments into curated, inspiring content. Scroll through an endlessly refreshing feed of beautiful photography, short-form video Reels, and detailed stories from friends, influencers, and brands, allowing you to explore the world through a creative and aesthetic lens. Its powerful editing tools, complete with stunning filters, robust adjustments, and intuitive cropping, make it simple for anyone to turn a quick snap into a professional-looking image ready for sharing. The **Stories** feature lets you post ephemeral content—short videos and photos that disappear after 24 hours—perfect for sharing behind-the-scenes glimpses or day-to-day happenings with interactive elements like polls, questions, and music. Dive into **Reels** to discover or create entertaining, short, multi-clip videos with audio, effects, and text overlays, offering a space for comedy, trends, and artistic expression. Use **Direct Messaging** to share posts privately, keep up with close friends, and engage in more intimate conversations. Whether you're building a professional portfolio, cultivating a personal brand, following your favorite celebrities, or simply seeking daily inspiration, Instagram is the visually-driven community that connects millions through shared passions and breathtaking imagery. It's the ultimate app for visual discovery and self-expression, fostering a global creative dialogue one photo and video at a time.",
    "size": 220,
    "reviews": "110M",
    "ratingAvg": 4.5,
    "downloads": "5M",
    "ratings": [
      { "name": "1 star", "count": 3000000 },
      { "name": "2 star", "count": 2000000 },
      { "name": "3 star", "count": 7000000 },
      { "name": "4 star", "count": 20000000 },
      { "name": "5 star", "count": 78000000 }
    ]
  },
  {
    "image": "https://img.icons8.com/color/128/000000/twitter--v1.png",
    "title": "X (Twitter)",
    "companyName": "X Corp.",
    "id": 4,
    "description": "X, formerly known as Twitter, is the world's real-time information network, serving as the essential platform to join conversations, discover breaking news, and connect with communities globally as events unfold. It’s a dynamic, fast-paced stream of short, impactful messages, media, and opinions—a digital town square where news breaks first and perspectives clash and converge within seconds. Follow journalists, politicians, cultural icons, and your friends to get immediate updates on global and local events, from major sports scores to political developments, ensuring you're always on the pulse of current affairs. The simple act of 'posting' allows you to broadcast your thoughts, questions, and reactions to the world instantly, facilitating immediate public dialogue and debate. Engage by 'liking' or 'reposting' content, or dive deeper into trending topics by clicking on hashtags to see a complete view of the public conversation. X is unique in its ability to facilitate organic community growth; whether you're interested in cryptocurrency, niche artistic movements, or local government, there's a community and a conversation waiting for you. It's a powerful tool for citizen journalism, activism, and simply staying entertained with viral memes and jokes. Download X to cut through the noise and get straight to the heart of what's happening now, transforming your phone into a live, interactive wire service that connects you to millions of voices shaping the modern narrative every second of the day.",
    "size": 190,
    "reviews": "92M",
    "ratingAvg": 3.9,
    "downloads": "10M",
    "ratings": [
      { "name": "1 star", "count": 6000000 },
      { "name": "2 star", "count": 3500000 },
      { "name": "3 star", "count": 10000000 },
      { "name": "4 star", "count": 25000000 },
      { "name": "5 star", "count": 47500000 }
    ]
  },
  {
    "image": "https://img.icons8.com/color/128/000000/tiktok.png",
    "title": "TikTok",
    "companyName": "ByteDance Ltd.",
    "id": 5,
    "description": "TikTok is the premier global destination for short-form mobile video, where creativity is boundless and cultural trends are born in a matter of hours. The app’s signature **For You Page (FYP)** uses a cutting-edge algorithm to deliver an endless stream of personalized, addictive content, making discovery feel instantaneous and deeply relevant to your interests—you'll find yourself scrolling for hours, effortlessly entertained and always finding something new. It’s a platform for everyone, from seasoned creators to casual viewers, empowering users to create and discover short videos set to music, using a vast library of sounds, filters, effects, and intuitive editing tools that make professional-looking production accessible to all. Whether you’re into comedy sketches, cooking tutorials, dance challenges, educational content, or simply want to witness viral phenomena as they take off, TikTok provides an immediate dose of cultural zeitgeist. Its unique blend of music, visual effects, and community engagement encourages participation, turning viewers into creators with prompts, duets, and stitch features. The app is a powerhouse for niche communities, allowing users to find their people, share passions, and celebrate diverse voices from around the world. Download TikTok to unleash your creative potential or simply sit back and enjoy the world’s most exciting and rapidly evolving video feed, a place where fun, innovation, and global connection happen one 15-to-60-second clip at a time.",
    "size": 150,
    "reviews": "98M",
    "ratingAvg": 4.6,
    "downloads": "30M",
    "ratings": [
      { "name": "1 star", "count": 2500000 },
      { "name": "2 star", "count": 1800000 },
      { "name": "3 star", "count": 6000000 },
      { "name": "4 star", "count": 18000000 },
      { "name": "5 star", "count": 70000000 }
    ]
  },
  {
    "image": "https://img.icons8.com/color/128/000000/youtube-play.png",
    "title": "YouTube",
    "companyName": "Google LLC",
    "id": 6,
    "description": "YouTube is the world’s largest video platform, a colossal digital library where you can watch, stream, and share videos across every conceivable topic, from music and entertainment to education and breaking news. It is the ultimate source of content, whether you're looking for a feature-length documentary, a five-minute DIY tutorial, or the latest viral music video—if it exists on video, it's on YouTube. The platform's powerful search and recommendation engines are fine-tuned to your viewing habits, ensuring your homepage is a continuous source of highly relevant, engaging content from your favorite creators and emerging channels alike. Subscribe to millions of channels to create a personalized, on-demand TV experience, receiving notifications for new uploads and diving into playlists of content that speaks directly to your interests. Beyond passive viewing, YouTube empowers you to become a creator, offering tools for uploading, editing, and sharing your own videos with a global audience of billions, turning a simple hobby into a potential career. Enjoy features like live streaming, enabling real-time interaction with creators, and the ability to download videos for offline viewing, making your commute or travel time more productive and entertaining. From full-length courses and historical archives to daily vlogs and comedy shorts, YouTube is more than just a video site; it is a cultural phenomenon, a learning resource, and the definitive destination for digital video consumption that continues to shape global media and entertainment consumption patterns.",
    "size": 160,
    "reviews": "150M",
    "ratingAvg": 4.5,
    "downloads": "100M",
    "ratings": [
      { "name": "1 star", "count": 4000000 },
      { "name": "2 star", "count": 3000000 },
      { "name": "3 star", "count": 8000000 },
      { "name": "4 star", "count": 28000000 },
      { "name": "5 star", "count": 107000000 }
    ]
  },
  {
    "image": "https://img.icons8.com/color/128/000000/telegram-app--v1.png",
    "title": "Telegram",
    "companyName": "Telegram FZ-LLC",
    "id": 7,
    "description": "Telegram is a cutting-edge, cloud-based messaging app explicitly designed for superior speed and robust security, making it one of the most reliable and feature-rich communication tools available today. Unlike many competitors, Telegram’s core strength lies in its server infrastructure, allowing for rapid message delivery even with slow connections and across massive groups. Its cloud-based architecture ensures that all your chats, media, and documents are securely stored and instantly accessible from any of your devices—phone, tablet, or desktop—without the need for cumbersome backups. Security is paramount, with options for **Secret Chats** that use end-to-end encryption and self-destruct timers, ensuring privacy for your most sensitive conversations. Telegram shines in its powerful group features, supporting groups of up to 200,000 members, complete with flexible administrative tools, customization options, and the ability to pin important messages. Beyond groups, **Channels** provide a way to broadcast one-to-many messages to unlimited audiences, making it a favorite for news organizations, creators, and public figures. You can share large files—up to 2GB each—making it a perfect tool for professional collaboration and sharing high-resolution media. With its commitment to speed, security, and powerful features like customizable themes and animated stickers, Telegram offers a distinctly advanced and versatile messaging experience that caters to both personal intimacy and large-scale public communication needs.",
    "size": 90,
    "reviews": "42M",
    "ratingAvg": 4.7,
    "downloads": "15M",
    "ratings": [
      { "name": "1 star", "count": 500000 },
      { "name": "2 star", "count": 300000 },
      { "name": "3 star", "count": 2000000 },
      { "name": "4 star", "count": 8000000 },
      { "name": "5 star", "count": 31000000 }
    ]
  },
  {
    "image": "https://img.icons8.com/color/128/000000/snapchat.png",
    "title": "Snapchat",
    "companyName": "Snap Inc.",
    "id": 8,
    "description": "Snapchat is the camera-first social media app that revolutionized instant sharing, allowing you to communicate and share moments instantly through photos, stories, and chat that emphasize spontaneity and the present moment. Its unique feature is the ephemeral nature of content: Snaps and Chats disappear after they're viewed, encouraging authentic, unpolished communication between close friends without the pressure of a permanent public profile. The **Snap Map** lets you see where your friends are and what they’re up to, fostering real-world connections and spontaneous meetups. The heart of the app is the camera, which is continuously updated with thousands of fun, augmented reality **Lenses** and filters that transform your appearance, your surroundings, and even your voice, making every photo and video a creative playground. Use **Stories** to string together a narrative of your day for your followers, or discover content from media publishers and creators in the **Discover** section. Snapchat is also a vibrant messaging platform, with video and voice calling capabilities built directly into your chat threads, complete with unique **Bitmoji** integration that represents you in every conversation. It’s an essential app for friends to keep up with each other's day-to-day lives in a playful, low-stakes environment, celebrating the moment you’re in rather than curating a historical feed. Download Snapchat to dive into the fun, creative world of instant, camera-driven communication.",
    "size": 180,
    "reviews": "58M",
    "ratingAvg": 4.2,
    "downloads": "17M",
    "ratings": [
      { "name": "1 star", "count": 2000000 },
      { "name": "2 star", "count": 1300000 },
      { "name": "3 star", "count": 5000000 },
      { "name": "4 star", "count": 12000000 },
      { "name": "5 star", "count": 37000000 }
    ]
  },
  {
    "image": "https://img.icons8.com/color/128/000000/spotify.png",
    "title": "Spotify",
    "companyName": "Spotify AB",
    "id": 9,
    "description": "Spotify is the leading digital music, podcast, and video service that gives you instant access to millions of songs, playlists, and original content anytime, anywhere, transforming the way the world consumes audio. Imagine a boundless library of global music at your fingertips, from the latest chart-topping hits and independent artists to deep-cut classics spanning every genre imaginable. The app's core strength lies in its unmatched **personalized recommendation engine**, which learns your unique listening habits to create perfect, algorithmically-generated playlists like 'Discover Weekly' and 'Daily Mixes' that constantly introduce you to your next favorite track. You can create, share, and collaborate on your own playlists, effectively becoming a DJ for your friends and community. Beyond music, Spotify hosts an enormous and continuously growing collection of **podcasts**, offering exclusive and popular shows covering news, comedy, true crime, and educational topics, allowing you to consume your favorite audio content seamlessly between work, exercise, or relaxation. With both a free, ad-supported tier and a premium, ad-free subscription offering offline listening and higher audio quality, Spotify adapts to every listener's needs and budget. It integrates flawlessly with smart devices, speakers, and cars, ensuring your soundtrack follows you effortlessly. Download Spotify to unlock the power of audio discovery and carry the entire world of sound in your pocket, making every moment of your day more vibrant and soundtracked.",
    "size": 110,
    "reviews": "88M",
    "ratingAvg": 4.4,
    "downloads": "20M",
    "ratings": [
      { "name": "1 star", "count": 1500000 },
      { "name": "2 star", "count": 1000000 },
      { "name": "3 star", "count": 4000000 },
      { "name": "4 star", "count": 16000000 },
      { "name": "5 star", "count": 66500000 }
    ]
  },
  {
    "image": "https://img.icons8.com/color/128/000000/linkedin.png",
    "title": "LinkedIn",
    "companyName": "Microsoft Corporation",
    "id": 10,
    "description": "LinkedIn is the world's premier professional networking platform, meticulously designed to help you connect, learn, and grow your career by fostering meaningful professional relationships and unlocking new opportunities. Think of it as your living, interactive resume and the definitive hub for industry news and insights. Build a compelling professional profile that showcases your work history, skills, and achievements, giving recruiters and industry peers a comprehensive view of your expertise. The platform's powerful search function allows you to connect with colleagues, alumni, and thought leaders in your field, expanding your professional network and opening doors to mentorship and collaboration. Stay current with a personalized feed of professional news, articles, and updates from companies and connections you follow, ensuring you're always informed about industry trends, job market shifts, and emerging technologies. **Job Seekers** can utilize its robust job board, which offers thousands of listings, tailored recommendations, and easy-apply options, simplifying the process of finding your next role. **Learning** is a key component, with LinkedIn Learning offering thousands of video courses taught by industry experts to help you master new skills or advance existing ones. Whether you are actively seeking a job, looking to hire top talent, or simply aiming to establish yourself as a thought leader, LinkedIn provides the tools and the community to elevate your professional life, making it an indispensable resource for career development and industry engagement.",
    "size": 130,
    "reviews": "32M",
    "ratingAvg": 4.3,
    "downloads": "6M",
    "ratings": [
      { "name": "1 star", "count": 900000 },
      { "name": "2 star", "count": 700000 },
      { "name": "3 star", "count": 2000000 },
      { "name": "4 star", "count": 9000000 },
      { "name": "5 star", "count": 19400000 }
    ]
  },
  {
    "image": "https://img.icons8.com/color/128/000000/gmail.png",
    "title": "Gmail",
    "companyName": "Google LLC",
    "id": 11,
    "description": "Gmail is the secure, fast, and smart email application from Google, offering an intuitive and powerful platform to manage all your inboxes easily, whether you’re handling professional communication or personal correspondence. At its core, Gmail leverages Google’s cutting-edge AI to filter out spam, categorize your mail automatically into primary, social, and promotions tabs, and offer **Smart Reply** suggestions, making the process of sifting through messages and responding quick and efficient. Its unparalleled search capabilities mean you can find any email, attachment, or conversation history instantly, no matter how old it is. Security is a top priority, with robust protections against phishing, malware, and spam that work quietly in the background to keep your account safe. The app offers a clean, uncluttered interface that makes reading and writing emails a pleasant experience across all your devices. Integration with the broader Google ecosystem is seamless: you can easily access Google Meet for video calls, Google Chat for instant messaging, and Google Calendar for scheduling, all without leaving the application environment. Features like **confidential mode** allow you to set expiration dates on messages and require a passcode for viewing, adding an extra layer of privacy for sensitive information. Gmail is designed to streamline your communication, reduce inbox stress, and ensure that your most important messages are always front and center, establishing it as the definitive email client for billions of users worldwide who demand reliability, intelligence, and integration in their digital life.",
    "size": 95,
    "reviews": "77M",
    "ratingAvg": 4.5,
    "downloads": "100M",
    "ratings": [
      { "name": "1 star", "count": 1000000 },
      { "name": "2 star", "count": 800000 },
      { "name": "3 star", "count": 2500000 },
      { "name": "4 star", "count": 13000000 },
      { "name": "5 star", "count": 60000000 }
    ]
  },
  {
    "image": "https://img.icons8.com/color/128/000000/google-maps.png",
    "title": "Google Maps",
    "companyName": "Google LLC",
    "id": 12,
    "description": "Google Maps is the world's most comprehensive and trusted navigation app, your indispensable guide to navigating, exploring, and finding the best routes, restaurants, and attractions no matter where you are. Harnessing satellite imagery, aerial photography, and street view technology, the app provides real-time, turn-by-turn GPS navigation for driving, walking, cycling, and public transit, constantly optimizing your route based on live traffic conditions, accidents, and road closures to save you time. Beyond simply getting you from point A to point B, Google Maps acts as a powerful local search engine: you can discover and review millions of businesses, from finding the highest-rated coffee shop with open hours nearby to booking a table at a new restaurant. **Street View** offers an immersive, panoramic look at locations, helping you get your bearings before you even arrive. You can download maps for **offline use**, a crucial feature for navigating in areas with poor connectivity or avoiding data charges while traveling internationally. The app provides detailed transit information, allowing you to track buses and trains in real-time, making urban travel seamless. It also helps you explore hidden gems with curated lists of local attractions and personalized recommendations based on your past visits and preferences. Google Maps is the essential tool that blends world-class mapping technology with local business intelligence, giving you the confidence to explore any neighborhood or country with clarity and ease.",
    "size": 140,
    "reviews": "91M",
    "ratingAvg": 4.6,
    "downloads": "35M",
    "ratings": [
      { "name": "1 star", "count": 1200000 },
      { "name": "2 star", "count": 700000 },
      { "name": "3 star", "count": 2400000 },
      { "name": "4 star", "count": 11000000 },
      { "name": "5 star", "count": 74000000 }
    ]
  },
  {
    "image": "https://img.icons8.com/color/128/000000/discord-new-logo.png",
    "title": "Discord",
    "companyName": "Discord Inc.",
    "id": 13,
    "description": "Discord is the ultimate chat, voice, and video platform built for creating and nurturing communities, evolving from its gamer roots into a versatile space for every type of shared interest, hobby, or professional group. Imagine having your own private, customizable digital HQ where you can engage in real-time voice conversations without having to call, participate in lively text chats categorized by topic, and share screens or videos with a few clicks. The platform is structured around **Servers**, which are persistent, invite-only spaces broken down into distinct text channels and voice channels, allowing communities to organize discussions logically, whether it’s for coding, book clubs, remote work, or gaming. Its crystal-clear **Voice Chat** is a standout feature, utilizing low latency to feel like you’re sitting in the same room as your friends. Beyond simple chat, Discord offers rich features like custom emoji, powerful moderation tools for server owners, and the ability to stream gameplay or presentations. The platform supports **Video Calls** and **Screen Sharing** for more intimate or collaborative sessions. Unlike traditional social media, Discord is designed for deeper, more focused interaction, giving members control over notifications and privacy settings within each server. Whether you are leading a massive online movement, coordinating a raid in a video game, or just having a casual movie night with a few friends, Discord provides the flexible, high-quality, and community-focused infrastructure to make digital interaction feel engaging and personal.",
    "size": 160,
    "reviews": "44M",
    "ratingAvg": 4.7,
    "downloads": "69M",
    "ratings": [
      { "name": "1 star", "count": 400000 },
      { "name": "2 star", "count": 300000 },
      { "name": "3 star", "count": 1000000 },
      { "name": "4 star", "count": 5000000 },
      { "name": "5 star", "count": 37300000 }
    ]
  },
  {
    "image": "https://img.icons8.com/color/128/000000/reddit.png",
    "title": "Reddit",
    "companyName": "Reddit Inc.",
    "id": 14,
    "description": "Reddit is often called the 'front page of the internet,' a massive network of user-generated communities where you can dive into discussions, discover trending topics, and explore virtually any interest imaginable. The platform is structured into over a million specialized forums called **Subreddits (r/)**, each focused on a specific topic—from r/AskScience and r/PersonalFinance to r/aww for cute animal pictures—ensuring there’s a community for every niche, hobby, and professional field. Content, which can be links, text posts, images, or videos, is sorted by a robust voting system: users 'upvote' good content to raise its visibility and 'downvote' irrelevant or poor content, democratically curating the most engaging discussions to the top. This system makes Reddit an unparalleled source of real-time, organic content and community-driven news. The heart of the experience lies in the comments, which are often deep, insightful, humorous, and sometimes completely bizarre, facilitating profound conversations on a global scale. You can subscribe to your favorite subreddits to create a perfectly customized feed, making the vastness of the internet feel manageable and personal. Whether you want to learn a new skill through an AMA (Ask Me Anything) with an expert, follow the latest breaking news, or just find some entertaining memes, Reddit provides a distinct, community-first social experience that is authentic, engaging, and reflective of the entire spectrum of human interests.",
    "size": 200,
    "reviews": "37M",
    "ratingAvg": 4.4,
    "downloads": "3M",
    "ratings": [
      { "name": "1 star", "count": 800000 },
      { "name": "2 star", "count": 600000 },
      { "name": "3 star", "count": 2200000 },
      { "name": "4 star", "count": 8000000 },
      { "name": "5 star", "count": 25400000 }
    ]
  },
  {
    "image": "https://img.icons8.com/color/128/000000/amazon.png",
    "title": "Amazon Shopping",
    "companyName": "Amazon Mobile LLC",
    "id": 15,
    "description": "Amazon Shopping is your ultimate mobile gateway to the world's largest online marketplace, allowing you to shop millions of products with unparalleled convenience, fast delivery, secure payments, and access to millions of trusted real reviews. Transform your smartphone into a powerful personal shopping assistant, where you can browse, search, and purchase virtually anything, from daily essentials and home goods to high-end electronics and niche specialty items. The app provides a seamless and intuitive shopping experience, complete with high-resolution images, detailed product information, and one-click purchasing options. Key features include **Voice Shopping**, allowing you to search products hands-free; **Image Search**, where you can snap a photo of a product or barcode to find it instantly; and personalized recommendations based on your browsing and purchase history. Security is paramount, with a robust and encrypted payment system that keeps your financial information safe. You can easily track your orders from the moment of purchase through to delivery with real-time updates. The value of Amazon lies not just in its massive inventory but also in its community-driven insights: millions of customer reviews and ratings provide crucial information to help you make informed purchasing decisions. For Prime members, the app unlocks immediate access to exclusive deals, fast, free shipping, and seamless access to Amazon’s entertainment services. Download Amazon Shopping to carry a full-scale department store in your pocket, ensuring you can find what you need, when you need it, and get it delivered right to your door.",
    "size": 180,
    "reviews": "101M",
    "ratingAvg": 4.5,
    "downloads": "12M",
    "ratings": [
      { "name": "1 star", "count": 2300000 },
      { "name": "2 star", "count": 1400000 },
      { "name": "3 star", "count": 4000000 },
      { "name": "4 star", "count": 14000000 },
      { "name": "5 star", "count": 79500000 }
    ]
  },
  {
    "image": "https://img.icons8.com/color/128/000000/netflix.png",
    "title": "Netflix",
    "companyName": "Netflix, Inc.",
    "id": 16,
    "description": "Netflix is the world's leading subscription streaming service, offering unlimited access to a vast, constantly updated library of award-winning TV shows, blockbuster movies, and compelling documentaries, transforming how you consume entertainment. Cut the cord and dive into thousands of titles, including an extensive collection of globally recognized **Netflix Originals** that you won't find anywhere else. The app provides a high-quality, personalized viewing experience, leveraging a sophisticated recommendation engine that suggests shows and movies tailored precisely to your tastes, ensuring you spend more time watching and less time searching. Its intuitive interface allows for seamless browsing by genre, title, or category, and the ability to create multiple profiles ensures every family member gets a personalized viewing space. Key features include the ability to **download** titles for offline viewing, perfect for long flights or commutes, and seamless playback across all your devices, from your smartphone and tablet to your smart TV. You can resume watching exactly where you left off on any device, making your viewing experience truly fluid. With new content added weekly and a commitment to high-definition and even 4K viewing, Netflix provides endless, on-demand entertainment for every mood and occasion, solidifying its place as the definitive home for premium streaming content.",
    "size": 200,
    "reviews": "98M",
    "ratingAvg": 4.5,
    "downloads": "50M",
    "ratings": [
      { "name": "1 star", "count": 1900000 },
      { "name": "2 star", "count": 1300000 },
      { "name": "3 star", "count": 3500000 },
      { "name": "4 star", "count": 11000000 },
      { "name": "5 star", "count": 80300000 }
    ]
  },
  {
    "image": "https://img.icons8.com/color/128/000000/zoom.png",
    "title": "Zoom",
    "companyName": "Zoom Video Communications",
    "id": 17,
    "description": "Zoom is the industry-leading video conferencing platform that enables seamless, high-quality, and secure meetings, webinars, and collaboration for both professional and personal use. Designed for reliability and scale, Zoom effortlessly handles one-on-one calls to massive virtual events, becoming the essential tool for remote work, distance learning, and staying connected with family and friends across the globe. The app features crystal-clear HD video and audio, ensuring that every participant is seen and heard with exceptional clarity. Joining a meeting is as simple as a click, with intuitive controls for muting, video on/off, and sharing content. Powerful collaborative tools, such as **Screen Sharing** for presentations, **Whiteboarding** for brainstorming, and **In-Meeting Chat**, make virtual sessions productive and engaging. Users can customize their experience with virtual backgrounds, touch-up-my-appearance filters, and even real-time transcriptions. Security is built-in, with password protection, waiting rooms, and encryption protocols to maintain the privacy of your discussions. Whether you’re attending a global corporate board meeting, teaching a class of students from home, or hosting a virtual birthday party, Zoom offers the stable, feature-rich environment necessary to bring people together face-to-face, regardless of distance. It has cemented its status as the definitive, easy-to-use solution for all real-time communication needs in the digital age.",
    "size": 120,
    "reviews": "44M",
    "ratingAvg": 4.4,
    "downloads": "1M",
    "ratings": [
      { "name": "1 star", "count": 900000 },
      { "name": "2 star", "count": 700000 },
      { "name": "3 star", "count": 2500000 },
      { "name": "4 star", "count": 9000000 },
      { "name": "5 star", "count": 31000000 }
    ]
  },
  {
    "image": "https://img.icons8.com/color/128/000000/slack-new.png",
    "title": "Slack",
    "companyName": "Salesforce, Inc.",
    "id": 18,
    "description": "Slack is the industry-leading work communication and collaboration tool that replaces email and chaotic group chats with an organized, searchable, and efficient platform for teams of any size. Imagine a digital workspace where all your communication, files, and tools are unified in one place, making your workflow smoother and your team more connected. The platform is organized into **Channels**, which can be created for specific projects, teams, clients, or company-wide announcements, ensuring discussions are focused, transparent, and easy to follow. Its powerful search function is a game-changer, allowing you to quickly find old messages, shared files, and relevant conversations, meaning knowledge is never lost in an inbox abyss. Slack integrates seamlessly with thousands of other business applications—such as Google Drive, Salesforce, and Trello—allowing you to centralize notifications and act on information without ever leaving the app. Beyond text chat, Slack offers high-quality **Huddles** (informal audio/video calls) and full-featured video conferencing, perfect for quick check-ins or in-depth discussions. It allows external collaborators to join securely via **Slack Connect**, bridging the gap between your organization and your partners or clients. Slack elevates team collaboration by fostering a transparent, real-time environment that reduces the friction of context-switching and boosts overall productivity, truly organizing the chaos of modern work communication.",
    "size": 170,
    "reviews": "16M",
    "ratingAvg": 4.6,
    "downloads": "1M",
    "ratings": [
      { "name": "1 star", "count": 200000 },
      { "name": "2 star", "count": 150000 },
      { "name": "3 star", "count": 600000 },
      { "name": "4 star", "count": 3000000 },
      { "name": "5 star", "count": 12100000 }
    ]
  },
  {
    "image": "https://img.icons8.com/color/128/000000/pinterest--v1.png",
    "title": "Pinterest",
    "companyName": "Pinterest, Inc.",
    "id": 19,
    "description": "Pinterest is the visual discovery engine and inspirational hub where you can find and save creative ideas for every part of your life, from home decor and recipes to fashion, travel, and DIY projects. Think of it as a personalized digital mood board and idea catalogue that helps you turn inspiration into action. Users explore billions of **Pins**—visual bookmarks—that link out to helpful websites and resources, allowing you to collect and organize ideas onto thematic **Boards** for future use. Whether you are planning a wedding, redecorating your bedroom, looking for a new workout routine, or searching for a creative weekend craft, Pinterest provides a visually rich and endlessly searchable stream of curated content. Its powerful recommendation algorithm learns what inspires you, constantly surfacing new and relevant ideas that align with your taste and goals. The app is a non-judgmental space focused on positive discovery and execution: you can use it to map out your dream life, save recipes you intend to cook, or collect outfit ideas to try later. Features like the **Lens** allow you to take a photo of an object and instantly find related Pins, turning real-world inspiration into immediate digital discovery. Download Pinterest to spark your creativity and build a personalized visual roadmap for all your projects, passions, and aspirational moments, ensuring your next great idea is just a scroll away.",
    "size": 150,
    "reviews": "54M",
    "ratingAvg": 4.6,
    "downloads": "4M",
    "ratings": [
      { "name": "1 star", "count": 600000 },
      { "name": "2 star", "count": 400000 },
      { "name": "3 star", "count": 1200000 },
      { "name": "4 star", "count": 7000000 },
      { "name": "5 star", "count": 45000000 }
    ]
  },
  {
    "image": "https://img.icons8.com/color/128/000000/airbnb.png",
    "title": "Airbnb",
    "companyName": "Airbnb, Inc.",
    "id": 20,
    "description": "Airbnb is the world’s leading platform for booking unique homes and authentic local experiences, transforming the way people travel and opening up a world of possibilities beyond traditional hotels. Imagine finding a cozy treehouse in the woods, a stylish city apartment, or a beachfront villa for your next vacation, all curated by hosts who share their unique spaces and local knowledge. The app allows you to browse millions of listings across nearly every country, complete with high-resolution photos, verified reviews from fellow travelers, and robust filtering options to find the perfect place based on price, amenities, and location. Beyond accommodations, **Experiences** offer immersive activities led by local experts—from cooking classes and guided hikes to professional workshops—providing a deeper, more authentic way to engage with a new destination. The secure booking process ensures peace of mind, with integrated messaging tools to communicate directly with your host before and during your stay. Airbnb fosters a sense of belonging and encourages travelers to live like a local, not a tourist, making unique, memorable travel accessible to everyone. Whether you are planning a solo adventure, a family reunion, or a last-minute business trip, this app is the essential travel companion for discovering one-of-a-kind stays and activities that make any journey truly unforgettable.",
    "size": 160,
    "reviews": "28M",
    "ratingAvg": 4.7,
    "downloads": "9M",
    "ratings": [
      { "name": "1 star", "count": 300000 },
      { "name": "2 star", "count": 200000 },
      { "name": "3 star", "count": 800000 },
      { "name": "4 star", "count": 5000000 },
      { "name": "5 star", "count": 21500000 }
    ]
  },
  {
    "image": "https://img.icons8.com/color/128/000000/spotify.png",
    "title": "SoundCloud",
    "companyName": "SoundCloud Ltd.",
    "id": 21,
    "description": "SoundCloud is the world's largest open audio platform, a vibrant ecosystem where you can discover, stream, and share millions of tracks from the newest and most independent artists worldwide, making it the definitive destination for finding what's next in music. Unlike mainstream platforms, SoundCloud is a creative launchpad, giving anyone the power to upload and share their original sounds, leading to an incredibly diverse and often genre-defying catalogue that breaks the mold of commercial music. Dive into an enormous range of audio content, from nascent hip-hop producers and bedroom electronic artists to chart-topping stars who got their start on the platform. The feed is a constant source of fresh tracks and curated mixes from people you follow, ensuring you're always ahead of the curve in music discovery. Features like the **Comment Section**, which allows listeners to comment on specific points in a track’s waveform, foster a uniquely intimate connection between creators and their audience. You can create playlists, follow fellow users and artists, and explore the **Charts** to see what's trending globally or in specific genres. Whether you are a dedicated audiophile seeking underground sounds, an aspiring DJ looking for new mixes, or a creator ready to share your music with the world, SoundCloud provides an unmatched, community-driven space for audio expression and discovery that is raw, authentic, and constantly pushing the boundaries of sound.",
    "size": 130,
    "reviews": "16M",
    "ratingAvg": 4.3,
    "downloads": "1M",
    "ratings": [
      { "name": "1 star", "count": 500000 },
      { "name": "2 star", "count": 400000 },
      { "name": "3 star", "count": 1200000 },
      { "name": "4 star", "count": 4000000 },
      { "name": "5 star", "count": 9900000 }
    ]
  },
  {
    "image": "https://img.icons8.com/color/128/000000/paypal.png",
    "title": "PayPal",
    "companyName": "PayPal Holdings, Inc.",
    "id": 22,
    "description": "PayPal is the secure, global digital payments platform that simplifies the process of sending, receiving, and managing your money online, acting as a trusted intermediary for millions of users and businesses worldwide. Eliminate the need to share sensitive bank or credit card details every time you shop online; with PayPal, a simple login is all it takes to complete a transaction instantly and securely. The app allows for easy, instantaneous money transfers between friends and family, whether you’re splitting a dinner bill or sending a gift across the country. For online shoppers, PayPal provides an extra layer of **Buyer Protection** on eligible purchases, offering peace of mind when buying from unfamiliar merchants. Managing your finances is streamlined through a clean dashboard where you can track transactions, view your balance, and link or unlink various bank accounts and cards. The platform is universally accepted by millions of online retailers, making it an essential tool for cross-border commerce and everyday shopping. Features like invoicing and the ability to accept payments also make it an indispensable tool for freelancers and small businesses. Download PayPal to transform your mobile device into a secure digital wallet, giving you complete control over your money and enabling seamless, protected transactions anytime, anywhere.",
    "size": 110,
    "reviews": "36M",
    "ratingAvg": 4.2,
    "downloads": "5M",
    "ratings": [
      { "name": "1 star", "count": 900000 },
      { "name": "2 star", "count": 600000 },
      { "name": "3 star", "count": 2000000 },
      { "name": "4 star", "count": 7000000 },
      { "name": "5 star", "count": 25500000 }
    ]
  },
  {
    "image": "https://img.icons8.com/color/128/000000/google-drive--v2.png",
    "title": "Google Drive",
    "companyName": "Google LLC",
    "id": 23,
    "description": "Google Drive is the essential cloud storage service from Google, offering a powerful, integrated solution to securely save, share, and access all your files—from documents and photos to videos and backups—from anywhere in the world on any device. Imagine a secure, virtual hard drive that never runs out of space for your most important files (with expandable storage options), always synchronized and backed up automatically in the cloud. Its primary strength lies in its seamless integration with Google Workspace tools like **Docs, Sheets, and Slides**, allowing for real-time collaborative editing on documents with colleagues or classmates, making it the definitive platform for teamwork. You can easily share files or folders with customizable permissions (view, comment, or edit), maintaining full control over your data. Drive's powerful search function can even recognize text within images and PDFs, ensuring you can find any file instantly. The app's offline access feature means you can view and edit important files even without an internet connection, with changes automatically syncing when you reconnect. Whether you are a student backing up class notes, a professional managing project files, or just looking for a safe place to store your personal photo library, Google Drive provides the secure, flexible, and powerful infrastructure to keep your digital life organized, accessible, and collaborative.",
    "size": 130,
    "reviews": "81M",
    "ratingAvg": 4.6,
    "downloads": "47M",
    "ratings": [
      { "name": "1 star", "count": 800000 },
      { "name": "2 star", "count": 500000 },
      { "name": "3 star", "count": 2000000 },
      { "name": "4 star", "count": 10000000 },
      { "name": "5 star", "count": 68000000 }
    ]
  },
  {
    "image": "https://img.icons8.com/color/128/000000/duolingo-logo.png",
    "title": "Duolingo",
    "companyName": "Duolingo, Inc.",
    "id": 24,
    "description": "Duolingo is the world's most popular language-learning app, offering a fun, addictive, and scientifically-proven way to learn new languages with short, bite-sized lessons that feel more like a game than a chore. Transform your phone into a portable language classroom and master over 35 languages, from Spanish and French to Japanese and High Valyrian, all through an engaging gamified structure that keeps you motivated to maintain your daily streak. The lessons focus on reading, writing, listening, and speaking, employing a blend of repetition, visual cues, and challenging exercises to solidify your memory and understanding. You earn virtual currency, level up, and compete with friends in leaderboards, turning the often-tedious process of language acquisition into a competitive and rewarding experience. The curriculum is designed by language experts and is constantly refined to ensure maximum learning efficiency. Duolingo's friendly mascot, Duo the Owl, encourages consistent practice, which is the key to fluency. Whether you're planning a trip abroad, hoping to connect with family members who speak another language, or simply looking to challenge your mind, Duolingo provides a free, accessible, and highly effective platform that proves that learning a new language doesn't have to be boring. Download it today and start your journey toward bilingualism, one short, fun lesson at a time.",
    "size": 90,
    "reviews": "26M",
    "ratingAvg": 4.8,
    "downloads": "78M",
    "ratings": [
      { "name": "1 star", "count": 200000 },
      { "name": "2 star", "count": 150000 },
      { "name": "3 star", "count": 600000 },
      { "name": "4 star", "count": 5000000 },
      { "name": "5 star", "count": 20100000 }
    ]
  },
  {
    "image": "https://www.logo.wine/a/logo/Uber/Uber-Logo.wine.svg",
    "title": "Uber",
    "companyName": "Uber Technologies, Inc.",
    "id": 25,
    "description": "Uber is the leading global ride-sharing and mobility platform, allowing you to instantly request rides and get where you need to go quickly, safely, and conveniently with just a few taps on your phone. Eliminate the stress of hailing a cab or navigating complex transit systems; Uber connects you with a professional driver in minutes, providing a seamless door-to-door service in over 10,000 cities worldwide. The app offers a variety of ride options to suit every need and budget, from affordable shared rides to premium black car service. Before you confirm a ride, you’ll see the **upfront fare** estimate, the driver’s profile, and the vehicle’s details, ensuring complete transparency. **Real-time GPS tracking** lets you monitor your driver’s location and share your trip status with friends or family for added security. Safety is a core pillar, with features like an in-app emergency button, 24/7 support, and driver background checks. Beyond personal rides, Uber's platform often includes options for scooter or bike rentals, food delivery via Uber Eats, and freight services, making it a comprehensive mobility solution. Securely pay with a variety of options, and your receipt is automatically emailed, simplifying expense tracking. Download Uber to unlock efficient, on-demand transportation that makes navigating your city and your world simple and stress-free.",
    "size": 150,
    "reviews": "58M",
    "ratingAvg": 4.4,
    "downloads": "23M",
    "ratings": [
      { "name": "1 star", "count": 1200000 },
      { "name": "2 star", "count": 800000 },
      { "name": "3 star", "count": 2500000 },
      { "name": "4 star", "count": 9000000 },
      { "name": "5 star", "count": 44500000 }
    ]
  },
  {
    "image": "https://img.icons8.com/color/128/000000/google-photos.png",
    "title": "Google Photos",
    "companyName": "Google LLC",
    "id": 26,
    "description": "Google Photos is the intelligent home for all your memories, providing a secure, cloud-based solution to back up, organize, and effortlessly find all your photos and videos in one simple, beautiful place. Never worry about running out of phone storage again; once your photos are backed up to the cloud, you can safely delete them from your device while retaining full access. The app’s standout feature is its cutting-edge, **AI-powered search capability**: you can find specific photos by searching for people, places, or even things (like 'dogs at the beach' or 'blue shirts'), without ever having to manually tag them. Memories are automatically curated into engaging collages, movies, and animated stories, offering delightful, personalized blasts from the past. Editing is simple and powerful, with one-tap fixes, advanced color correction tools, and cinematic effects to make your photos look their best. Sharing is easy, allowing you to create private albums to share with friends and family, or seamlessly send large groups of photos without size limitations. Google Photos is more than just a backup tool; it's a smart photo assistant that preserves your most cherished moments, brings them to life through machine learning, and ensures they are always accessible across all your devices, making it the definitive platform for modern memory management.",
    "size": 100,
    "reviews": "52M",
    "ratingAvg": 4.6,
    "downloads": "88M",
    "ratings": [
      { "name": "1 star", "count": 700000 },
      { "name": "2 star", "count": 400000 },
      { "name": "3 star", "count": 1800000 },
      { "name": "4 star", "count": 8000000 },
      { "name": "5 star", "count": 41000000 }
    ]
  },
  {
    "image": "https://img.icons8.com/color/128/000000/canva.png",
    "title": "Canva",
    "companyName": "Canva Pty Ltd.",
    "id": 27,
    "description": "Canva is the revolutionary graphic design platform that empowers anyone, regardless of their design experience, to create stunning visuals for social media, professional posters, presentations, and virtually any other creative project. It eliminates the steep learning curve of traditional design software by offering a massive library of thousands of professionally-designed, customizable templates for everything from Instagram Stories and resumes to business cards and marketing flyers. The app features an incredibly intuitive drag-and-drop interface, making it easy to add photos, videos, text, and graphic elements to your creations. Access a huge library of free stock photos, icons, fonts, and illustrations to bring your ideas to life instantly. Collaboration is seamless: you can work on designs with your team in real-time, making it an essential tool for small businesses and marketing teams. Key tools include the ability to remove backgrounds, apply professional-grade filters, and resize designs instantly for different platforms. Whether you're a student needing to create a presentation, a small business owner designing a logo, or an influencer crafting daily social media content, Canva provides all the powerful, yet accessible, tools you need. Download Canva to unleash your inner designer and create high-quality, professional-looking graphics in minutes, transforming complex design tasks into a fun and simple creative process.",
    "size": 190,
    "reviews": "24M",
    "ratingAvg": 4.8,
    "downloads": "32M",
    "ratings": [
      { "name": "1 star", "count": 200000 },
      { "name": "2 star", "count": 150000 },
      { "name": "3 star", "count": 500000 },
      { "name": "4 star", "count": 4000000 },
      { "name": "5 star", "count": 19600000 }
    ]
  },
  {
    "image": "https://img.icons8.com/color/128/000000/microsoft-teams.png",
    "title": "Microsoft Teams",
    "companyName": "Microsoft Corporation",
    "id": 28,
    "description": "Microsoft Teams is the all-in-one hub for teamwork and collaboration, designed to bring people, conversations, content, and tools together securely in one unified workspace, making it an essential platform for modern businesses and educational institutions. It seamlessly integrates chat, video meetings, file storage, and application integration, replacing multiple disparate tools with a single, highly efficient platform. The app is structured around persistent, topic-based **Channels** where teams can hold real-time conversations, share files, and co-author documents with ease, ensuring all relevant project information is centralized and searchable. Its robust **Video Conferencing** capabilities support large meetings with high-quality audio and video, complete with features like background blur, live captions, and recording. As a core part of the Microsoft 365 ecosystem, Teams integrates flawlessly with Word, Excel, PowerPoint, and SharePoint, allowing you to edit and share documents directly within the application environment. Security and compliance are top-tier, ensuring your sensitive corporate data is protected by Microsoft’s enterprise-grade security. Whether you are conducting a daily stand-up meeting, collaborating on a critical document, or communicating with a global team, Microsoft Teams provides the secure, feature-rich, and deeply integrated environment necessary to keep your organization connected and highly productive, serving as the definitive virtual office for millions.",
    "size": 210,
    "reviews": "38M",
    "ratingAvg": 4.3,
    "downloads": "89M",
    "ratings": [
      { "name": "1 star", "count": 900000 },
      { "name": "2 star", "count": 700000 },
      { "name": "3 star", "count": 2000000 },
      { "name": "4 star", "count": 7000000 },
      { "name": "5 star", "count": 28000000 }
    ]
  },
  {
    "image": "https://img.icons8.com/color/128/000000/adobe-photoshop.png",
    "title": "Adobe Photoshop Express",
    "companyName": "Adobe Inc.",
    "id": 29,
    "description": "Adobe Photoshop Express is the streamlined, mobile-optimized photo editor from the world's leader in creative software, allowing you to edit photos easily with advanced filters, effects, and powerful tools right from your phone or tablet. Harness the core power of Photoshop in a fast, accessible app designed for on-the-go content creators and casual users alike. You can perform quick yet professional-quality edits, from basic cropping and straightening to sophisticated one-touch corrections for color, contrast, and exposure. Dive deeper with hundreds of stunning looks, filters, and effects that instantly transform the mood and style of your images. The app features powerful tools for removing noise, blurring backgrounds, and adding artistic textures to give your photos a polished, high-end finish. Healing features allow you to remove blemishes and unwanted objects seamlessly, while the collage maker helps you tell a story with multiple shots. Adobe Photoshop Express is fully integrated with Adobe Creative Cloud, giving you the flexibility to work across multiple devices and access your creative assets easily. Whether you're touching up a selfie, preparing photos for a social media post, or making subtle adjustments to professional shots, this app provides an intuitive, feature-rich experience that ensures your pictures always look their absolute best, maintaining the high standard of quality expected from the Photoshop name.",
    "size": 230,
    "reviews": "22M",
    "ratingAvg": 4.6,
    "downloads": "100M",
    "ratings": [
      { "name": "1 star", "count": 300000 },
      { "name": "2 star", "count": 200000 },
      { "name": "3 star", "count": 800000 },
      { "name": "4 star", "count": 4000000 },
      { "name": "5 star", "count": 16700000 }
    ]
  },
  {
    "image": "https://img.icons8.com/color/128/000000/netflix-desktop-app.png",
    "title": "Netflix",
    "companyName": "Netflix, Inc.",
    "id": 30,
    "description": "Netflix is the world's leading subscription streaming service, offering unlimited access to a vast, constantly updated library of award-winning TV shows, blockbuster movies, and compelling documentaries, transforming how you consume entertainment. Cut the cord and dive into thousands of titles, including an extensive collection of globally recognized **Netflix Originals** that you won't find anywhere else. The app provides a high-quality, personalized viewing experience, leveraging a sophisticated recommendation engine that suggests shows and movies tailored precisely to your tastes, ensuring you spend more time watching and less time searching. Its intuitive interface allows for seamless browsing by genre, title, or category, and the ability to create multiple profiles ensures every family member gets a personalized viewing space. Key features include the ability to **download** titles for offline viewing, perfect for long flights or commutes, and seamless playback across all your devices, from your smartphone and tablet to your smart TV. You can resume watching exactly where you left off on any device, making your viewing experience truly fluid. With new content added weekly and a commitment to high-definition and even 4K viewing, Netflix provides endless, on-demand entertainment for every mood and occasion, solidifying its place as the definitive home for premium streaming content.",
    "size": 200,
    "reviews": "68M",
    "ratingAvg": 4.5,
    "downloads": "42M",
    "ratings": [
      { "name": "1 star", "count": 1500000 },
      { "name": "2 star", "count": 1000000 },
      { "name": "3 star", "count": 3500000 },
      { "name": "4 star", "count": 10000000 },
      { "name": "5 star", "count": 52000000 }
    ]
  }
]